app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-09-28 14:21:51.247992"], ["id", 4]]
---
  def update
    #raise params.inspect
    @post = Post.find(params[:id])
    @post.update(title: params[:title], description: params[:description])